<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>
    Download the Appsforlife Boxshot Application
    ARCH must be either ARM or Intel
    </string>
    <key>Identifier</key>
    <string>com.github.mosen.download.Appsforlife.Boxshot</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Boxshot</string>
        <key>DOWNLOADS_URL</key>
        <string>https://boxshot.com/downloads/</string>
        <key>ARCH</key>
        <string>ARM</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOADS_URL%</string>
                <key>re_pattern</key>
                <string>\/\/cdn\.appsforlife\.com\/boxshot\/[1-9]\/[1-9]\.[1-9]\.[1-9]\/Boxshot[1-9]_%ARCH%\.dmg</string>
                <key>result_output_var_name</key>
                <string>DOWNLOAD_URL</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https:%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%_%ARCH%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
