<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
  <key>Description</key>
  <string>Downloads the current release version of the Origami plugin and imports into Munki.</string>
  <key>Identifier</key>
  <string>com.github.mosen.munki.Appsforlife.Origami</string>
  <key>Input</key>
  <dict>
    <key>NAME</key>
    <string>Origami</string>
    <key>MUNKI_REPO_SUBDIR</key>
    <string>plugins/Appsforlife</string>
    <key>MUNKI_CATEGORY</key>
    <string>Design</string>
    <key>pkginfo</key>
    <dict>
      <key>catalogs</key>
      <array>
        <string>testing</string>
      </array>
      <key>category</key>
      <string>%MUNKI_CATEGORY%</string>
      <key>description</key>
      <string>Fold up your die drawings in Illustrator!</string>
      <key>developer</key>
      <string>Appsforlife</string>
      <key>display_name</key>
      <string>Origami</string>
      <key>name</key>
      <string>%NAME%</string>
      <key>unattended_install</key>
      <true/>
    </dict>
  </dict>
  <key>MinimumVersion</key>
  <string>0.2.9</string>
  <key>ParentRecipe</key>
  <string>com.github.mosen.download.Appsforlife.Origami</string>
  <key>Process</key>
  <array>
    <dict>
      <key>Processor</key>
      <string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
      <key>Arguments</key>
      <dict>
        <key>input_string</key>
        <string>%ARCH%</string>
        <key>find</key>
        <string>ARM</string>
        <key>replace</key>
        <string>arm64</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>com.github.homebysix.FindAndReplace/FindAndReplace</string>
      <key>Arguments</key>
      <dict>
        <key>input_string</key>
        <string>%output_string%</string>
        <key>find</key>
        <string>Intel</string>
        <key>replace</key>
        <string>x86_64</string>
      </dict>
    </dict>
    <dict>
      <key>Processor</key>
      <string>MunkiPkginfoMerger</string>
      <key>Arguments</key>
      <dict>
        <key>additional_pkginfo</key>
        <dict>
          <key>supported_architectures</key>
            <array>
              <string>%output_string%</string>
            </array>
        </dict>
      </dict>
		</dict>       
    <dict>
      <key>Processor</key>
      <string>MunkiImporter</string>
      <key>Arguments</key>
      <dict>
          <key>pkg_path</key>
          <string>%pathname%</string>
          <key>repo_subdirectory</key>
          <string>%MUNKI_REPO_SUBDIR%</string>
      </dict>
    </dict>
  </array>
</dict>
</plist>